org/arbete.org
#+title: Djupinlärning av 3-SAT

* Anteckningar
  
** Förklara orden/förklara:
   Modul, dimension av vektor, vektorkomponent, list (python), parametrar
   till en funktion (python), funktionparameter på följande vis: f(arg1, arg2)
   Rectifier, Sigmoid, objekt orienterade termer (objekt och metod), softmax, 
   Stokastiskt gradient nedgång
   
** Fixa:
   Att jag har skrivit numpy.funktion men bör bara konsekvent med np.funktion
   instället

** Referenser:
   Att 3-sat är ett NP problem och alla NP problem är ekvivalenta.

* Abstract
* Inledning
** Bakgrund
** Syfte och Frågeställning
* Teori
** Propositionell logik
** Linjär algebra
*** Vektor
*** Matris
*** Matris vektor multiplikation
** Deep learning
*** Bildlig förklaring
*** Linjär algebra
*** Flervariabel analys
**** Funktioner av flera variabler
**** Paritalderivata
**** 
** Grunderna till python och programering
* Metod
** Skapandet av datan
*** Krav på datan
    Oavsett hur man bygger upp det neurala nätverket så behövs det
    data med exempel som är redan lösta. I detta arbete är syftet se om
    ett neuralt nätverk kan avgöra om ett 3-SAT problem är satisferbart
    eller inte. Alltså ska inputen vara ett 3-SAT problem och outputen vara
    en indikation på om det är satisferbart eller inte. För konstruktion
    av de neurala nätverk kommer modulen Tensorflow användas. Med den modulen
    krävs det att man har två listor: en för inputen och en för outputen. Alltså
    kommer första exemplets formell vara första elementet i inputlistan och
    svaret kommer vara första elementet i outputlistan. I detta arbete valdes det
    60 000 träningsexempel och 10 000 utvärderingsexempel. Träningsexempelerna
    är de exempel det neurala nätverket kommer analysera och anpassa sig efter.
    Utvärderingsexemplerna är de som kommer användas i betygsättning av hur
    bra nätverket fungerar. Anledningen varför dessa måste vara separata är att
    det är väldigt enkelt för neurala nätverk att endast memorera exemplerna
    som användes vid träningen. Därför krävs det att exempelerna är unika
    så att inget exempel i träningsdatan finns dessutom i utvärderingsdatan.

    Ett annat krav är att inputen och outputen är i form av en vektor av
    reella värden. Detta är inte ett problem för outputen då man kan ha en
    2 dimensionell vektor där första värdet är sannolikheten att formeln är
    falsk och andra värdet är sannolikheten att den är sann (se exempel1). En
    lika tydlig lösning för inputen finns dock inte. Ett förslag är att 
    associera ett värde till varje tecken och sedan låta antalet tecken
    beteckna dimensionen på vektorn (se exempel2). Som man dock ser i exempel
    (k0lla om det är två eller 2) två så är dimensionen av vektorn onödigt stor
    då vissa tecken har alltid samma värde. De enda tecknen som kan vara olika
    är variablerna. I denna text kommer detta faktum utnyttjas, då antalet 
    variabler i uttrycket kommer motsvara dimensionen av vektorn. 
    
    # Ett annat krav är att andelen sanna och falska formler fördelar sig lika.
    # Om ett svar skulle överväga så skulle nätverket kunna ställa in sig på att
    # endast svara det som är i majoritet. Detta är ett problem eftersom 
    # indikationen på om nätverket faktiskt gör någonting är att precisionen
    # är högre än en gissning. En gissning i det här fallet är 50% då det finns
    # två utfall. Antag t.ex. att det finns 

**** Figurer till parent sektion:
     exempel1, exempel2

*** Omvandling av 3-SAT formler
    Låt variablerna i en formel ordnas i viss order, exempelvis alfabetsordning
    och sedan stigande i nummer index. Den första variabeln kommer motsvara
    värdet 1, den andra 2, den tredje 3 o.s.v. Sedan när man har kodat för
    den sista variabeln med värdet $n$ så låter man $n+1$ symbolisera
    negationen av den första variabeln och $n+2$ negationen för den andra
    variabeln o.s.v. Sedan låtes det första variabeltecknet i formeln koda 
    för första värdet i vektorn och den andra den andra värdet 
    o.s.v. (se exempel3).

    I denna text kommer det dessutom begränsas till max 5 olika variabler
    i varje formel. Därmed så kan varje heltal (om man tar hänsyn till ledande
    nollor) symbolisera en unik formel (se exempel4). Detta löser nästan
    problemet om att skapa 60 000 träningsexempel och 10 000 utvärderingsexempel
    som är alla unika. Eftersom varje heltal motsvarar en unik formel så kan man
    låta de talen från 0 till och med 59 999 koda för träningsexempelarna 
    och talen 60 000 till 69 999 koda för utvärderingsexempelarna. Dock, somsagt
    löser detta nästan problemet. Första problemet är att om man ska ha fem 
    stycken värdesiffror så kommer formelerna vara fem variabler långa. Men 
    ett 3-SAT problem är på formen av en konjuktion av disjuktioner av längden
    tre variabler. Därför måste antalet variabler vara lika med en multipel 
    av tre. Det andra problemet är att formeln är kort och när en formel 
    är kortare så är det mindre chans att det blir en falsk formel (om man 
    antar att antalet olika variabler håller sig konstant). Anledningen är att
    fler konjuktioner begränsar antalet möjliga lösningar (om antalet variabler
    håller sig konstant). Ett exempel på detta ges i (exempel5).
    
    Lösningen på detta är att införa slumpmässiga siffror efter. På detta vis
    kommer alla exempel vara unika, och längden kan anpassas till en multipel
    av tre. I denna text kommer längden vara 72 variabler d.v.s fem bestämda
    siffror och 67 slumpmässiga.

**** Figurer till parent paragraf:
     exempel3, exempel4, exempel5

*** Simple-Sat
    Simple-sat är en 3-SAT lösare kodad av Sahand Saba, och används i detta
    arbete under MIT lisens. Den tar in en input i string format där varje
    konjuktion är separerad med ett komma och disjuktioner är separerade med 
    ett mellanslag.Så en variabel kan vara vilken kombination av bokstäver och
    siffror så länge det inte innehåller ett mellanslag. Det innebär att
    till skillnad från programspråk som python så kan en enkel siffra vara en
    unik variabel. Detta är i fördel till omvandlingen i denna metod eftersom
    varje siffra kodar en viss variabel. För att beteckna negationen används 
    tecknet tilde (~) framför variabeln utan mellanslag. Betrakta exempelA.

    Problemet med detta program är att det kan endast bli tillkallad i en terminal.
    En terminal är ett helt textbaserat program som man kan skriva in kommandon
    till för att starta olika program. De främsta operativsystemen är egentligen
    en terminal som kör i bakgrunden och det grafiska användargränsnitt
    man har tillgänglig är ett program som körs genom terminalen. Om man använder
    windows så heter terminalprogrammet "CMD", på Ubuntu heter (den som ingår)
    bash. 3-SAT programmet är gjort för terminaler under operativsystem Linux.
    Så två problem måste lösas. Det första problemet är att omvandla en string av 
    siffror till en formel som 3-SAT programet kan tolka. Det andra problemet
    är hur man ska kunna intargera med detta program genom python, då programet
    är gjord för att användas i en terminal i linux.

    
    
    För att få tillgång
    till att skicka kommandon till terminalen via python använder man modulen
    subprocess. För subprocess.check_output tar in som argument ett terminal
    kommando ger tillbaka resultatet av vad som skrevs i terminalen.


**** fig stuff
     exempelA

*** Omvandling till formel
    För att omvandla en string av siffror till en string i det format 3-SAT
    programmet tar emot definerar vi funktionen generate_formula. Generate
    formula tar argumentet *seed* som är stringen av siffror. Funktionen inleds
    med att definera två variabler.

kodA
#+BEGIN_SRC python
digits = seed
formula = []
disjunction_counter  = 0
#+END_SRC

    Seed döps om av den enkla anledningen att det kommer hjälpa med tydlighet
    i en loop som kommer senare. Formula variabeln är där alla tecken till
    formeln kommer läggas till. Vid slutet av programmet kommer elementen i 
    formula sättas ihop till formel stringen, men eftersom man har mer 
    kontroll med listor, defineras den som en tom lista i början.

**** Figurer och sånt
     kodA

*** Algoritm
