org/cooltex/arbete.tex
\docume\documentclass[11pt]{article}
\usepackage{amsmath, amssymb, amscd, amsthm, amsfonts}
\usepackage{graphicx}
\usepackage{hyperref}

\oddsidemargin 0pt
\evensidemargin 0pt
\marginparwidth 40pt
\marginparsep 10pt
\topmargin -20pt
\headsep 10pt
\textheight 8.7in
\textwidth 6.65in
\linespread{1.2}


\usepackage[swedish]{babel}

\newtheorem{theorem}{Sats}[section]
\newtheorem{definition}[theorem]{Definition}
\newtheorem{lemma}[theorem]{Lemma}
\newtheorem{proposition}[theorem]{Proposition}
\newtheorem{corollary}[theorem]{Korollarium}
\newtheorem{example}[theorem]{Exempel}

\author{John Paul Edward Möller}
\title{Djupinlärning av Neurala nätverk}

\begin{document}

\maketitle
\tableofcontents


\section{Anteckningar}
\label{sec:org1d86332}

\subsection{Förklara orden/förklara:}
\label{sec:org2073c1a}
Modul, dimension av vektor, vektorkomponent, list (python), parametrar
till en funktion (python), funktionparameter på följande vis: f(arg1, arg2)
Rectifier, Sigmoid, objekt orienterade termer (objekt och metod), softmax, 
Stokastiskt gradient nedgång

\subsection{Fixa:}
\label{sec:org6ab3374}
Att jag har skrivit numpy.funktion men bör bara konsekvent med np.funktion
instället

\subsection{Referenser:}
\label{sec:org6e81812}
Att 3-sat är ett NP problem och alla NP problem är ekvivalenta.

\section{Abstract}
\label{sec:org86ed8d4}
\section{Inledning}
\label{sec:orge571083}
\subsection{Bakgrund}
\label{sec:orgad0db53}
\subsection{Syfte och Frågeställning}
\label{sec:orgb03441e}
\section{Teori}
\label{sec:orgc88c63a}
\subsection{Propositionell logik}
\label{sec:orgb6f265e}
\subsection{Linjär algebra}
\label{sec:org9ee1b01}
\subsubsection{Vektor}
\label{sec:org9afa89b}
\subsubsection{Matris}
\label{sec:org85403bc}
\subsubsection{Matris vektor multiplikation}
\label{sec:orgbc85b98}
\subsection{Deep learning}
\label{sec:org7cf406b}
\subsubsection{Bildlig förklaring}
\label{sec:org3e22e03}
\subsubsection{Linjär algebra}
\label{sec:org3a4f7ea}
\subsubsection{Flervariabel analys}
\label{sec:org4389528}
\begin{enumerate}
\item Funktioner av flera variabler
\label{sec:org2e40f1e}
\item Paritalderivata
\label{sec:orgaed94f5}
\item 
\label{sec:org229e890}
\end{enumerate}
\subsection{Grunderna till python och programering}
\label{sec:org0b41e8c}
\section{Metod}
\label{sec:org8bc8527}
\subsection{Skapandet av datan}
\label{sec:orgc85ca46}
\subsubsection{Krav på datan}
\label{sec:org9c9ca05}
Oavsett hur man bygger upp det neurala nätverket så behövs det
data med exempel som är redan lösta. I detta arbete är syftet se om
ett neuralt nätverk kan avgöra om ett 3-SAT problem är satisferbart
eller inte. Alltså ska inputen vara ett 3-SAT problem och outputen vara
en indikation på om det är satisferbart eller inte. För konstruktion
av de neurala nätverk kommer modulen Tensorflow användas. Med den modulen
krävs det att man har två listor: en för inputen och en för outputen. Alltså
kommer första exemplets formell vara första elementet i inputlistan och
svaret kommer vara första elementet i outputlistan. I detta arbete valdes det
60 000 träningsexempel och 10 000 utvärderingsexempel. Träningsexempelerna
är de exempel det neurala nätverket kommer analysera och anpassa sig efter.
Utvärderingsexemplerna är de som kommer användas i betygsättning av hur
bra nätverket fungerar. Anledningen varför dessa måste vara separata är att
det är väldigt enkelt för neurala nätverk att endast memorera exemplerna
som användes vid träningen. Därför krävs det att exempelerna är unika
så att inget exempel i träningsdatan finns dessutom i utvärderingsdatan.

Ett annat krav är att inputen och outputen är i form av en vektor av
reella värden. Detta är inte ett problem för outputen då man kan ha en
2 dimensionell vektor där första värdet är sannolikheten att formeln är
falsk och andra värdet är sannolikheten att den är sann (se exempel1). En
lika tydlig lösning för inputen finns dock inte. Ett förslag är att 
associera ett värde till varje tecken och sedan låta antalet tecken
beteckna dimensionen på vektorn (se exempel2). Som man dock ser i exempel
(k0lla om det är två eller 2) två så är dimensionen av vektorn onödigt stor
då vissa tecken har alltid samma värde. De enda tecknen som kan vara olika
är variablerna. I denna text kommer detta faktum utnyttjas, då antalet 
variabler i uttrycket kommer motsvara dimensionen av vektorn. 

\begin{enumerate}
\item Figurer till parent sektion:
\label{sec:org6a13527}
exempel1, exempel2
\end{enumerate}

\subsubsection{Omvandling av 3-SAT formler}
\label{sec:org3afd24f}
Låt variablerna i en formel ordnas i viss order, exempelvis alfabetsordning
och sedan stigande i nummer index. Den första variabeln kommer motsvara
värdet 1, den andra 2, den tredje 3 o.s.v. Sedan när man har kodat för
den sista variabeln med värdet \(n\) så låter man \(n+1\) symbolisera
negationen av den första variabeln och \(n+2\) negationen för den andra
variabeln o.s.v. Sedan låtes det första variabeltecknet i formeln koda 
för första värdet i vektorn och den andra den andra värdet 
o.s.v. (se exempel3).

I denna text kommer det dessutom begränsas till max 5 olika variabler
i varje formel. Därmed så kan varje heltal (om man tar hänsyn till ledande
nollor) symbolisera en unik formel (se exempel4). Detta löser nästan
problemet om att skapa 60 000 träningsexempel och 10 000 utvärderingsexempel
som är alla unika. Eftersom varje heltal motsvarar en unik formel så kan man
låta de talen från 0 till och med 59 999 koda för träningsexempelarna 
och talen 60 000 till 69 999 koda för utvärderingsexempelarna. Dock, somsagt
löser detta nästan problemet. Första problemet är att om man ska ha fem 
stycken värdesiffror så kommer formelerna vara fem variabler långa. Men 
ett 3-SAT problem är på formen av en konjuktion av disjuktioner av längden
tre variabler. Därför måste antalet variabler vara lika med en multipel 
av tre. Det andra problemet är att formeln är kort och när en formel 
är kortare så är det mindre chans att det blir en falsk formel (om man 
antar att antalet olika variabler håller sig konstant). Anledningen är att
fler konjuktioner begränsar antalet möjliga lösningar (om antalet variabler
håller sig konstant). Ett exempel på detta ges i (exempel5).

Lösningen på detta är att införa slumpmässiga siffror efter. På detta vis
kommer alla exempel vara unika, och längden kan anpassas till en multipel
av tre. I denna text kommer längden vara 72 variabler d.v.s fem bestämda
siffror och 67 slumpmässiga.

\begin{enumerate}
\item Figurer till parent paragraf:
\label{sec:orgca6f8d3}
exempel3, exempel4, exempel5
\end{enumerate}

\subsubsection{Simple-Sat}
\label{sec:orga22eb0e}
Simple-sat är en 3-SAT lösare kodad av Sahand Saba, och används i detta
arbete under MIT lisens. Den tar in en input i string format där varje
konjuktion är separerad med ett komma och disjuktioner är separerade med 
ett mellanslag.Så en variabel kan vara vilken kombination av bokstäver och
siffror så länge det inte innehåller ett mellanslag. Det innebär att
till skillnad från programspråk som python så kan en enkel siffra vara en
unik variabel. Detta är i fördel till omvandlingen i denna metod eftersom
varje siffra kodar en viss variabel. För att beteckna negationen används 
tecknet tilde (\textasciitilde{}) framför variabeln utan mellanslag. Betrakta exempelA.

Problemet med detta program är att det kan endast bli kallad i en terminal.
För att ka

\begin{enumerate}
\item fig stuff
\label{sec:org45bc771}
exempelA
\end{enumerate}
