org/arbete.org
**** Algoritmen på en allmän nivå
     1. Skapa en tom lista för all träningsdata
     2. Skapa en tom lista för all utvärderingsdata
     3. Låt n = 0
     4. Omvandla n till en lista med 5 värden
     5. Skapa en lista med 67 slumpmässiga värden
     6. Sätt ihop listorna från 2 och 3 till en ny lista
     7. Lägg till listan från 8 i input träningsdata listan (1)
     8. Omvandla listan från  8 till en formel
     9. Kolla om formeln från 10 är satisferbar
     10. Om den är satiferbar lägg till en etta i output träningsdatan
     11. Om den inte är det lägg till en nolla i output träningsdatan
     12. Repetera steg 3 till 13 där n ökar med ett varje gång, tills n=69999
     13. Exportera datan
**** Algortimen i python kod
***** Numpy arrays
      För att översätta den allmänna koden till python så skulle det
      tekniskt gå att ha vanliga listor. Men p.g.a att det är så stora
      värden samt att vi vill senare kunna exportera dessa listor, så
      är det mer praktiskt att använda en modul som heter Numpy. Listor
      i numpy heter "numpy arrays". Numpy arrays fungerar i omfattningen
      av denna text i princip som vanliga lists. Enda skillnaden är att
      det inte går att direkt modifera dem. Om man vill ändra en variabel
      som innehåller en numpy array så måste man skapa en ny array baserad 
      på den gamla och sedan spara den nya i variabeln (betrakta kod1). För 
      att skapa en numpy array använder man funktionen numpy.array. Som 
      argument sätter man i en vanlig list som numpy arrayen kommer efterlikna. 
      Betrakta kod2.
      
      kod2 (eller 1?)
     #+BEGIN_SRC python
       import numpy

numpy_array = numpy.array([4,2,0])
#+END_SRC


      Fotnot till kod2: Det är två paranteser p.g.a att man kan sätta in
      flera parametrar och de arrays man vill lägga ihop sätter man in
      i första parametern.

      
      En sak man måste ta i hänsyn med numpy är att man måste specifiera vid
      skapandet av en array vad för typ alla element kan vara. Man kan därmed
      inte ha olika typer. Detta i kontrast till vanliga listor som man kan 
      ha flera olika typer. Betrakta exempel6 där listan av sig själv fungerar
      men om man omvandlar till en numpy array skapas det ett felmedelande. 
      Man kan dock skapa en tom arrray och lägga till värden, så detta är inte
      ett problem för ouputdatan. Men för input datan så har man en sammling av
      listor av storleken 72. Om man skulle skapa en tom numpy array 
      och en numpy array med 72 element och sedan försöka använda numpy.concatenate,
      visas ett felmedelande. Man är då tvungen att vid skapandet av numpy arrayen
      för träningsdata redan ha ett element som är en numpy array på storleken 72.
      Ett enkelt sätt att göra detta är med funktionen numpy.zeros. Numpy.zeros
      tar in en storlek som argument och skapar en numpy array fylld med nollor
      med den specifierade storleken. För att skapa en array med 5 nollor skriver
      man numpy.zeros(5). För att skapa en array fylld med 3 arrays där varje
      array har 2 nollor skriver man numpy.zeros((3,2)) (se kod3). 

      Eftersom träningsdatan kommer vara en array där varje element är
      en array på 72 element, så skriver man numpy.zeros((1,72)). Ett problem
      som uppstår på grund av detta är att första träningsexemplet kommer vara
      på plats två och det andra på plats 3 o.s.v (se figur1). Detta löses dock 
      enkelt genom att ta bort det första elementet i slutet av algoritmen. Man
      kan göra detta med funktionen numpy.delete. En sista detalj är att
      koden så betecknas input med x och output med y. Notationen är inte för
      någon speciell anledning, för att det ska bli enklare att skriva
      variabeln. Så steg 1 och två kan översättas till följande kod:

#+BEGIN_SRC python
  import numpy as np

  x_train = np.zeros((1,72))
  y_train = np.array([])
#+END_SRC
***** Loopen steg 3 till 7
      Nästa del i koden är att påbörja loopen från steg 3 till 12. Första steget
      i loopen är att omvandla n till en lista med fem värdesiffror. För det
      första så är det mer korrekt enlight pythons rekomederade stilformat att
      ha ord istället för bokstäver som variabler, så n kommer reffereras som num
      i python koden. Omvandlingen av num delades upp i fyra delar. Först
      omvandlades num till en String. Sedan lades det eventuellt på ledande 
      nollor för att få Stringen att ha 5 värdesiffror. Sedan omvandlades den
      till en vanlig lista, och tillsist en numpy array. Steg 1 och 2 blev en rad
      och steg 3 och 4 blev också en rad. Koden såg ut som följande:
      
      kod4
#+BEGIN_SRC python
num_string = str(num).zfill(5)
head_array = np.array(int_list(num_string))
#+END_SRC

      Steg 5 skrevs på följande vis:

kod5
#+BEGIN_SRC python
tail_array = np.random.randint(10, size=67)
#+END_SRC

      Första argumentet anger då att alla heltal under det givna nummret
      får slumpmässigt skapas, och size parametern talar om för storleken av
      arrayen som skapas. 

      För att sedan lägga ihop de två arraysen används np.concatenate.

kod6
#+BEGIN_SRC python
array_to_append = np.concatenate((head_array,tail_array))
#+END_SRC

      Sedan för att lägga till denna array till träningsdatan använder
      np.concatenate för att updatera x_train.

kod7
#+BEGIN_SRC python
x_train = np.concatenate((x_train, [array_to_append]))
#+END_SRC

      
****** Figurer
       Kod1, Kod2, exempel6, kod3, figur1, kod4, kod5, kod6, kod7

***** Loppen steg 8 till 11
     För att se om formeln är satisferbar eller inte används en 3-SAT lösare 
     programerad av Sahand Saba under MIT licens. Sabas program körs egentligen
     via terminalen, men den är tillgänglig med modulen satsolver.py som finns
     beskriven i appendix I. Modulen innehåller två funktioner:
     satsolver.generate_formula och satsolver.check. Satsolver.generate_formula
     tar en numpy array och omvandlar den enligt metoden beskriven i omvandling
     av 3-sat, till en formel satsolver.check kan ta som argument. Satsolver.check
     ger då värdet noll om formeln är ej satisferbar och värdet ett om 
     den är satisferbar. Så koden blir som följande:
     
kod8
#+BEGIN_SRC python
formula = sat.generate_formula(array_to_append)
value_to_append = sat.check(formula)
y_train = np.append(y_train, value_to_append)
#+END_SRC

      Ett steg som inte står beskrivet i den allmänna algortimen, är att 
      radera det elementet i x_train. Detta var som sagt p.g.a vid skapandet
      av x_train behövdes ett element fylld av nollor som specifierade storleken
      på arrayen. Så för att radera det första elementet i x_train används
      följande kod:

kod9
#+BEGIN_SRC python
x_train = np.delete(x_train, 0, 0)
#+END_SRC




****** Figurer, kod och referatmarkörer
       Sahanda Saba, referens till omvandling av 3-sat, kod8, kod9
***** Export av datan
      För att exportera numpy arrays används funktionen np.save. Funktionen tar
      in namnet på en filplats och numpy arrayen man vill spara. I detta projekt
      så sparades filerna i mapp kallad 'data'. Så exporterings koden såg ut som
      följande:
      
#+BEGIN_SRC python
np.save('data/x_train', x_train)
np.save('data/y_train', y_train)
#+END_SRC

****** Kod saker:
       ko10
***** Anpassning för utvärderingsdatan
      Koden för utvärderingsdata är i princip likadan. Enda skillnaden är att
      num fick variera mellan 60 000 och 69 999 och datan sparades som x_test
      och y_test för input datan respektive output datan.
**** Pythonkoden actually
** Skapandet av modellen
*** Representation av modellen
    Modellen består alltså av 10 lager med 128 noder var, där Rectifier är 
    aktiveringsfunktionen. Det finns dessutom ett till lager i slutet som 
    består av endast en nod och har Sigmoid aktiveringsfunktionen (se figur2).
