org/cooltex/arbete.tex

\subsubsection{Algoritm}
\label{sec:orgc11c65d}
\begin{enumerate}
\item Algoritmen på en allmän nivå
\label{sec:org5aa3f17}
\begin{enumerate}
\item Skapa en tom lista för all träningsdata
\item Skapa en tom lista för all utvärderingsdata
\item Låt n = 0
\item Omvandla n till en lista med 5 värden
\item Skapa en lista med 67 slumpmässiga värden
\item Sätt ihop listorna från 2 och 3 till en ny lista
\item Lägg till listan från 8 i input träningsdata listan (1)
\item Omvandla listan från  8 till en formel
\item Kolla om formeln från 10 är satisferbar
\item Om den är satiferbar lägg till en etta i output träningsdatan
\item Om den inte är det lägg till en nolla i output träningsdatan
\item Repetera steg 3 till 13 där n ökar med ett varje gång, tills n=69999
\item Exportera datan
\end{enumerate}
\item Algortimen i python kod
\label{sec:orgdd02eb6}
\begin{enumerate}
\item Numpy arrays
\label{sec:org6fdb3bb}
För att översätta den allmänna koden till python så skulle det
tekniskt gå att ha vanliga listor. Men p.g.a att det är så stora
värden samt att vi vill senare kunna exportera dessa listor, så
är det mer praktiskt att använda en modul som heter Numpy. Listor
i numpy heter "numpy arrays". Numpy arrays fungerar i omfattningen
av denna text i princip som vanliga lists. Enda skillnaden är att
det inte går att direkt modifera dem. Om man vill ändra en variabel
som innehåller en numpy array så måste man skapa en ny array baserad 
på den gamla och sedan spara den nya i variabeln (betrakta kod1). För 
att skapa en numpy array använder man funktionen numpy.array. Som 
argument sätter man i en vanlig list som numpy arrayen kommer efterlikna. 
Betrakta kod2.

kod2 (eller 1?)
\begin{verbatim}
       import numpy

numpy_array = numpy.array([4,2,0])
\end{verbatim}


Fotnot till kod2: Det är två paranteser p.g.a att man kan sätta in
flera parametrar och de arrays man vill lägga ihop sätter man in
i första parametern.


En sak man måste ta i hänsyn med numpy är att man måste specifiera vid
skapandet av en array vad för typ alla element kan vara. Man kan därmed
inte ha olika typer. Detta i kontrast till vanliga listor som man kan 
ha flera olika typer. Betrakta exempel6 där listan av sig själv fungerar
men om man omvandlar till en numpy array skapas det ett felmedelande. 
Man kan dock skapa en tom arrray och lägga till värden, så detta är inte
ett problem för ouputdatan. Men för input datan så har man en sammling av
listor av storleken 72. Om man skulle skapa en tom numpy array 
och en numpy array med 72 element och sedan försöka använda numpy.concatenate,
visas ett felmedelande. Man är då tvungen att vid skapandet av numpy arrayen
för träningsdata redan ha ett element som är en numpy array på storleken 72.
Ett enkelt sätt att göra detta är med funktionen numpy.zeros. Numpy.zeros
tar in en storlek som argument och skapar en numpy array fylld med nollor
med den specifierade storleken. För att skapa en array med 5 nollor skriver
man numpy.zeros(5). För att skapa en array fylld med 3 arrays där varje
array har 2 nollor skriver man numpy.zeros((3,2)) (se kod3). 

Eftersom träningsdatan kommer vara en array där varje element är
en array på 72 element, så skriver man numpy.zeros((1,72)). Ett problem
som uppstår på grund av detta är att första träningsexemplet kommer vara
på plats två och det andra på plats 3 o.s.v (se figur1). Detta löses dock 
enkelt genom att ta bort det första elementet i slutet av algoritmen. Man
kan göra detta med funktionen numpy.delete. En sista detalj är att
koden så betecknas input med x och output med y. Notationen är inte för
någon speciell anledning, för att det ska bli enklare att skriva
variabeln. Så steg 1 och två kan översättas till följande kod:

\begin{verbatim}
import numpy as np

x_train = np.zeros((1,72))
y_train = np.array([])
\end{verbatim}
\item Loopen steg 3 till 7
\label{sec:orga66736f}
Nästa del i koden är att påbörja loopen från steg 3 till 12. Första steget
i loopen är att omvandla n till en lista med fem värdesiffror. För det
första så är det mer korrekt enlight pythons rekomederade stilformat att
ha ord istället för bokstäver som variabler, så n kommer reffereras som num
i python koden. Omvandlingen av num delades upp i fyra delar. Först
omvandlades num till en String. Sedan lades det eventuellt på ledande 
nollor för att få Stringen att ha 5 värdesiffror. Sedan omvandlades den
till en vanlig lista, och tillsist en numpy array. Steg 1 och 2 blev en rad
och steg 3 och 4 blev också en rad. Koden såg ut som följande:

kod4
\begin{verbatim}
num_string = str(num).zfill(5)
head_array = np.array(int_list(num_string))
\end{verbatim}

Steg 5 skrevs på följande vis:

kod5
\begin{verbatim}
tail_array = np.random.randint(10, size=67)
\end{verbatim}

Första argumentet anger då att alla heltal under det givna nummret
får slumpmässigt skapas, och size parametern talar om för storleken av
arrayen som skapas. 

För att sedan lägga ihop de två arraysen används np.concatenate.

kod6
\begin{verbatim}
array_to_append = np.concatenate((head_array,tail_array))
\end{verbatim}

Sedan för att lägga till denna array till träningsdatan använder
np.concatenate för att updatera x\textsubscript{train}.

kod7
\begin{verbatim}
x_train = np.concatenate((x_train, [array_to_append]))
\end{verbatim}


\begin{enumerate}
\item Figurer
\label{sec:org3de209f}
Kod1, Kod2, exempel6, kod3, figur1, kod4, kod5, kod6, kod7
\end{enumerate}

\item Loppen steg 8 till 11
\label{sec:org6a1d168}
För att se om formeln är satisferbar eller inte används en 3-SAT lösare 
programerad av Sahand Saba under MIT licens. Sabas program körs egentligen
via terminalen, men den är tillgänglig med modulen satsolver.py som finns
beskriven i appendix I. Modulen innehåller två funktioner:
satsolver.generate\textsubscript{formula} och satsolver.check. Satsolver.generate\textsubscript{formula}
tar en numpy array och omvandlar den enligt metoden beskriven i omvandling
av 3-sat, till en formel satsolver.check kan ta som argument. Satsolver.check
ger då värdet noll om formeln är ej satisferbar och värdet ett om 
den är satisferbar. Så koden blir som följande:

kod8
\begin{verbatim}
formula = sat.generate_formula(array_to_append)
value_to_append = sat.check(formula)
y_train = np.append(y_train, value_to_append)
\end{verbatim}

Ett steg som inte står beskrivet i den allmänna algortimen, är att 
radera det elementet i x\textsubscript{train}. Detta var som sagt p.g.a vid skapandet
av x\textsubscript{train} behövdes ett element fylld av nollor som specifierade storleken
på arrayen. Så för att radera det första elementet i x\textsubscript{train} används
följande kod:

kod9
\begin{verbatim}
x_train = np.delete(x_train, 0, 0)
\end{verbatim}




\begin{enumerate}
\item Figurer, kod och referatmarkörer
\label{sec:org4869e8f}
Sahanda Saba, referens till omvandling av 3-sat, kod8, kod9
\end{enumerate}
\item Export av datan
\label{sec:org480d8f3}
För att exportera numpy arrays används funktionen np.save. Funktionen tar
in namnet på en filplats och numpy arrayen man vill spara. I detta projekt
så sparades filerna i mapp kallad 'data'. Så exporterings koden såg ut som
följande:

\begin{verbatim}
np.save('data/x_train', x_train)
np.save('data/y_train', y_train)
\end{verbatim}

\begin{enumerate}
\item Kod saker:
\label{sec:orgfbf2d4b}
ko10
\end{enumerate}
\item Anpassning för utvärderingsdatan
\label{sec:org99486c8}
Koden för utvärderingsdata är i princip likadan. Enda skillnaden är att
num fick variera mellan 60 000 och 69 999 och datan sparades som x\textsubscript{test}
och y\textsubscript{test} för input datan respektive output datan.
\end{enumerate}
\item Pythonkoden actually
\label{sec:org7c02cee}
\end{enumerate}
\subsection{Skapandet av modellen}
\label{sec:org664d262}
\subsubsection{Representation av modellen}
\label{sec:orgec1d225}
Modellen består alltså av 10 lager med 128 noder var, där Rectifier är 
aktiveringsfunktionen. Det finns dessutom ett till lager i slutet som 
består av endast en nod och har Sigmoid aktiveringsfunktionen (se figur2).
