org/arbete.org
*** Tensorflow och Keras
    För att skapa den här modellen i python används modulerna Tensorflow och 
    Keras. Tensorflow är en modul som tillåter en att bygga neurala nätverk från 
    grunden. Keras är en modul som som förenklar byggandet och träningen av 
    neurala nätverk. I koden kommer dessa moduler och delar modulerna importeras:

kod11
#+BEGIN_SRC python
import numpy as np
from tensorflow import keras
from tensorflow.keras.layers import Activation, Dense
#+END_SRC

    För att skapa en tom modell som man sedan kan senare tillägga fler lager till 
    skriver man:

kod12
#+BEGIN_SRC python
model = keras.models.Sequential()  
#+END_SRC

    Variabeln model blir då ett objekt som symboliserar det neurala nätverket.
    För tillägg av lager samt träning och utvärdering av modellen används
    assosierade objekt metoder. För att lägga till ett lager (till höger om
    man tänker som fig2 där input går in till vänster och output går ut från
    höger) så använder man objektmetoden add. Som argument tar den vad för
    sorts lager. Den sortens lager som har hittils gått igenom i texten kallas
    i keras för 'Dense'. Det är alltså ett lager som kan symboliseras med en 
    matris, eller noder på rad, samt en associerad aktivationsfunktion. Så för
    att lägga till ett lager med 128 noder, och Rectifier som aktiveringsfunktionen
    skriver man:

    kod13
#+BEGIN_SRC python
model.add(Dense(128, activation='relu'))  
#+END_SRC

    relu symbolisera då Recitifier funktionen. Den här raden av kod repeteras
    då 10 gånger så att det blir totalt tio lager. Sista lagret är två noder
    där första noden är sannolikheten att det är noll och andra är sannolikheten
    att det är 1. Detta görs med aktiveringsfunktionen "softmax". Följande kod
    motsvarar detta lager:
    
kod14
#+BEGIN_SRC python
model.add(Dense(2, activation='softmax'))
#+END_SRC

    


**** Saker
     kod11, kod12, figur2, kod13
** Träning av nätverket
   För träning av nätverket används "binary cross entropy" som loss funktion,
   'accuracy' som metric och stokastisk gradient nedgång som optimizer.
   'Binary crossentropy' och 'accuracy' förklaras ej i detta arbete men dokumentaion
   om dessa funktioner finns på [ref2]. För att träna nätverket och sedan
   utvärdera det skrivs följande kod:

kod15
#+BEGIN_SRC python
model.compile(optimizer = 'SGD', loss='binary_crossentropy', metrics=['accuracy'])
model.fit(x_train, y_train, epochs=5)
model.evaluate(x_test, y_test, verbose=2)
#+END_SRC

   Epochs är hur många gånger den går igenom all data. Så epoch 1 är första
   gången den går igenom datan epoch 2 andra gången o.s.v. Verbose variabeln 
   specifierar bara hur mycket information som printas ut. 

*** Stuff ref kod och sånt
    ref2, kod15
* Resultat
** Model 1
   | Epoch | tid        | resultat |
   |-------+------------+----------|
   |     1 | 8 sekunder | 50 %     |
   |     2 | 7 sekunder | 50 %     |
   |     3 | 7 sekunder | 50 %     |
   |     4 | 7 sekunder | 50 %     |
   |     5 | 7 sekunder | 50 %     |
   
   Och för träningsdatan var resultatet 50 %.
* Diskussion och slutsats
** Sannolikhet att liknande (och därmed samma) sat formler fanns
** Presicionen var bara 50% som är lika med en gissning.
   Som man ser så var resultatet på samtliga delar av utvärderingsprocessen 
   50 %. Detta tyder med säkerhet att nätverket inte har hittat något mönster
   då det är lika med chansen för en gissning. Detta stödjer kontentan bland 
   forskare att P är skiljt från NP (ref3). Eftersom om det finns en tydligt 
   mönster som neurala nätverk kan se så skulle det öka chansen att det finns 
   en enklare algortim för 3-SAT problem av allmänn storlek, som är tillräckligt 
   enkel så att den är i polynomisk tid. Detta utesluter såklart dock inte att
   neurala nätverk kan tränas att lösa 3-SAT problem. På grund av att koden
   behövde köras på en persondator, så var antalet lager, noder, epochs, och
   träningsexempel begränsade till processorkraften och minnet tillgängligt.
*** Ref och sånt
    ref3
** Att man använder neurala nätverk för tydliga mönster och inte resonemang
** Samtidigt att det finns ingen teori om hur man känner igen människo ansikten
** Vad innebär att det finns en polynomisk algoritm för 3-sat
*** Banksystem faller 
** Vidare forskning
*** Djupare nätverk
**** 

* Appendix
** I
