org/cooltex/arbete.tex
\subsubsection{Tensorflow och Keras}
\label{sec:org45977ab}
För att skapa den här modellen i python används modulerna Tensorflow och 
Keras. Tensorflow är en modul som tillåter en att bygga neurala nätverk från 
grunden. Keras är en modul som som förenklar byggandet och träningen av 
neurala nätverk. I koden kommer dessa moduler och delar modulerna importeras:

kod11
\begin{verbatim}
import numpy as np
from tensorflow import keras
from tensorflow.keras.layers import Activation, Dense
\end{verbatim}

För att skapa en tom modell som man sedan kan senare tillägga fler lager till 
skriver man:

kod12
\begin{verbatim}
model = keras.models.Sequential()  
\end{verbatim}

Variabeln model blir då ett objekt som symboliserar det neurala nätverket.
För tillägg av lager samt träning och utvärdering av modellen används
assosierade objekt metoder. För att lägga till ett lager (till höger om
man tänker som fig2 där input går in till vänster och output går ut från
höger) så använder man objektmetoden add. Som argument tar den vad för
sorts lager. Den sortens lager som har hittils gått igenom i texten kallas
i keras för 'Dense'. Det är alltså ett lager som kan symboliseras med en 
matris, eller noder på rad, samt en associerad aktivationsfunktion. Så för
att lägga till ett lager med 128 noder, och Rectifier som aktiveringsfunktionen
skriver man:

kod13
\begin{verbatim}
model.add(Dense(128, activation='relu'))  
\end{verbatim}

relu symbolisera då Recitifier funktionen. Den här raden av kod repeteras
då 10 gånger så att det blir totalt tio lager. Sista lagret är två noder
där första noden är sannolikheten att det är noll och andra är sannolikheten
att det är 1. Detta görs med aktiveringsfunktionen "softmax". Följande kod
motsvarar detta lager:

kod14
\begin{verbatim}
model.add(Dense(2, activation='softmax'))
\end{verbatim}




\begin{enumerate}
\item Saker
\label{sec:org7033c50}
kod11, kod12, figur2, kod13
\end{enumerate}
\subsection{Träning av nätverket}
\label{sec:org6824ed3}
För träning av nätverket används "binary cross entropy" som loss funktion,
'accuracy' som metric och stokastisk gradient nedgång som optimizer.
'Binary crossentropy' och 'accuracy' förklaras ej i detta arbete men dokumentaion
om dessa funktioner finns på [ref2]. För att träna nätverket och sedan
utvärdera det skrivs följande kod:

kod15
\begin{verbatim}
model.compile(optimizer = 'SGD', loss='binary_crossentropy', metrics=['accuracy'])
model.fit(x_train, y_train, epochs=5)
model.evaluate(x_test, y_test, verbose=2)
\end{verbatim}

Epochs är hur många gånger den går igenom all data. Så epoch 1 är första
gången den går igenom datan epoch 2 andra gången o.s.v. Verbose variabeln 
specifierar bara hur mycket information som printas ut. 

\subsubsection{Stuff ref kod och sånt}
\label{sec:org139c741}
ref2, kod15
\section{Resultat}
\label{sec:orged1fe25}
\subsection{Model 1}
\label{sec:orgb7cc8ed}
\begin{center}
\begin{tabular}{rll}
Epoch & tid & resultat\\
\hline
1 & 8 sekunder & 50 \%\\
2 & 7 sekunder & 50 \%\\
3 & 7 sekunder & 50 \%\\
4 & 7 sekunder & 50 \%\\
5 & 7 sekunder & 50 \%\\
\end{tabular}
\end{center}

Och för träningsdatan var resultatet 50 \%.
\section{Diskussion och slutsats}
\label{sec:orgb4193fa}
\subsection{Sannolikhet att liknande (och därmed samma) sat formler fanns}
\label{sec:org867bd73}
\subsection{Presicionen var bara 50\% som är lika med en gissning.}
\label{sec:orgf3746df}
Som man ser så var resultatet på samtliga delar av utvärderingsprocessen 
50 \%. Detta tyder med säkerhet att nätverket inte har hittat något mönster
då det är lika med chansen för en gissning. Detta stödjer kontentan bland 
forskare att P är skiljt från NP (ref3). Eftersom om det finns en tydligt 
mönster som neurala nätverk kan se så skulle det öka chansen att det finns 
en enklare algortim för 3-SAT problem av allmänn storlek, som är tillräckligt 
enkel så att den är i polynomisk tid. Detta utesluter såklart dock inte att
neurala nätverk kan tränas att lösa 3-SAT problem. På grund av att koden
behövde köras på en persondator, så var antalet lager, noder, epochs, och
träningsexempel begränsade till processorkraften och minnet tillgängligt.
\subsubsection{Ref och sånt}
\label{sec:org1360f91}
ref3
\subsection{Att man använder neurala nätverk för tydliga mönster och inte resonemang}
\label{sec:orgb1fc944}
\subsection{Samtidigt att det finns ingen teori om hur man känner igen människo ansikten}
\label{sec:org03ab628}
\subsection{Vad innebär att det finns en polynomisk algoritm för 3-sat}
\label{sec:orgcbb362b}
\subsubsection{Banksystem faller}
\label{sec:org1de9b67}
\subsection{Vidare forskning}
\label{sec:org5c7f9cb}
\subsubsection{Djupare nätverk}
\label{sec:org67fe8f8}
\begin{enumerate}
\item 
\label{sec:orgdaaa714}
\end{enumerate}

\section{Appendix}
\label{sec:org43bc716}
\subsection{I}
\label{sec:org97024b7}
\end{document}